{
    "title": "Gains or Pains?",
    "intro": "With the lack of trust gained from the masses, the wanted positive impact that China is aiming to get with the BRI would be interpreted differently by different countries and perspectives. This creates a mix of negatives and positives in the overall impact of BRI on participating countries. Although on the surface, BRI should be an enormous step into the right direction to improve the economy of China and its participating countries, the efforts are leaving an obvious negative trail of various issues such as environmental degradation and can be seen as a selfish effort to boost the nation’s economy without much consideration over the negative environmental effects it may have on neighbouring countries.  ",
    "for_title":"Gains",
    "for": "Nonetheless, BRI has created millions of jobs for local populations as well as training opportunities to upskill, providing a boost to the local economy and potentially raising the standard of living. In an article (ASEAN, C. R. 2023) regarding a BRI Railway project in Indonesia, China Railway had a 1:4 employee ratio of Chinese-Indonesian, peaking at 1:7 reaching 51000 local jobs. In addition, it mentioned that due to the technology present, it can provide training sessions for welding, electric engineering, machinery and concrete pouring. With this, it can help employees gain better opportunities in the future.",
    "against_title":"Pains",
    "against": "Amidst all the success earned economically from the BRI, the Melaka Gateway Project remained as the failure that left small communities and the marine biodiversity to suffer without proper recovery or compensation. The Malaka Gateway Project launched in 2016 was to be a facility made of four islands in the Malacca Strait. Three of the islands would be reclaimed land and one existing land. With different purposes for each island, the Melaka Gateway Project was a grand plan to make Malacca Strait the ultimate industrial port integrated with business districts, entertainment hubs, and many more. However, when the losses of the project turned out to be huge and way more than the amounts invested into the project, it deemed the project unsuccessful and cancellations of the project occurred from 2018 to 2021, mid-progress. Tons of negative impacts surfaced as incomplete land reclamation works stood like white elephants in the coasts of Melaka. Resistance expressed by the residents of the Portuguese settlement in Melaka were ignored from the start eventhough they expressed that the land reclamation would violate the minimum distance required the island project from the coast of the Portuguese settlement. Social impact assessment was not carried out on the effects of the reclamation land on the livelihoods of people living in those settlements, and marine biodiversity would be permanently damaged by the land reclamation. Ignoring all these resistances, led to devastating impacts for the fishermen whose livelihood were affected by the loss of fishery due to the land reclamation and the damages to the marine biodiversity that has already been inflicted and even as of April 2024, the company has not given a clear compensation for the fishery community. Even though Malaysia’s government and China were all set on the gains they could have gotten from this project, the permanent loss that the fishery community had to face were completely ignored. This can be related to the effects of high modernization on nature. When people focus on wanting to make development projects such as roads and more buildings to benefit a country’s economy, the environment ends up having to take the consequence of having permanent damage and these consequences are deemed not as important as the success gained in the economy leading to negative long-term consequences that will need to be faced in future. "
    
  }