{
    "title": "Progress or Power Play?",
     "intro": "While BRI’s stated intentions promises progress through economic development, the other potential intentions require much discourse as China could use this initiative to exploit vulnerable countries and push geopolitical influence over them through China’s loaning scheme. ",
     "for_title":"Progress",
    "for": "Despite many questionings China’s intent of BRI, China has also shown clear intentions of cooperation for the pure objective of improving infrastructure, by stating their policies and measures through talks, exchanges and forums. This can be seen on an article (Deng, Y. 2024) written about China’s initiative to host Belt and Road Forum for International Cooperation (BRF) in Oct 2023, where Chinese President Xi Jinping proposed action plans and pledge to solve BRI’s problem of lack of institutionalisation. However, with a separate article (Dube, R., & Steinhauser , G. 2023), it is said that the BRI projects are of low quality and causing damages which increases their cost even more, causing further into debt. Hence, this raises more questions regarding China’s intentions, as regions are not only in debt, but they don't have what's promised. ",
    "against_title":"Power Play",
    "against": "Such an example would be when China consistently had great interest in the Hambantota project regardless of the projected weak performance of its port and the intentions of China questioned as it seemed like the project only served to satisfy China’s priority to secure international trade routes and ensure that international supply chains remain undisrupted.   China invested approximately $361 million on the project even while it was under fire by the Sri Lankan government due to its economic viability.  China also “donated” $295 million for Sri Lanka to spend on any project. Although the money did serve Sri Lanka well as they were able to build a kidney hospital thanks to the gift, this can be seen as an effort to gain the favour of Sri Lankan government. As the project progressed, so did the Sri Lankan debt to China giving a great example of debt diplomacy where China continues to loan Sri Lanka money that they clearly are unable to repay. Due to the massive debt, Sri Lanka ended up transferring 80% of the port’s ownership to China. Things got so out of control that even when Sri Lankan government wanted to cancel numerous Chinese projects, they were unable to do so resulting in handing over the Hambantota Port over to China. From this example we can truly see that China tries to ease their way into getting countries to agree to their development plans by giving huge sums of money and pretending to innocently invest to help pick up the country’s economy. However, when the project fails or country goes in immense debt, it ends with China gaining more than what they invested for and the country is left with devastating losses and disturbing amounts of debt to China. "
  }