{
    "intro":"Fear of Missing Out?",
    "body":"Earlier in our previous section on evaluating the Chinese One Belt, One Road initiative, we mentioned the point of debt dependency as a potential concern of the one belt, one road initiative. With China loaning out large sums to the recipients of the one belt, one road initiative, western critics are quick to bring up the potential of debt-trapping. This idea has been propagated by western leaders. However, are the things that are being said necessarily true? The answer in reality is far more nuanced.  Despite the complexity of the situation, why then are so many western naysayers so quick to jump to onto the bandwagon of claiming China is engaging in debt-trapping. One potential reasoning could be the fear of losing power to China and using fearmongering to push their own agenda (Rajah et al., 2021, P4) One example of this is the Sri Lankan port of Hambantota, Western observers cite this example where debt servicing incapabilities forced nations like Sri Lanka to lease vital infrastructure to China. However, the United States’ response to this, was to themselves loan funds to finance the establishment of a deepwater shipping-container terminal at the Port of Colombo in Sri Lanka as an effort to finance infrastructure around strategic parts of Asia (Gunasekara & Travelli, 2023). This feels quite hypocritical, having the solution to this Chinese debt-trap be loaning out more money. What then, could be the actual reason for the loan? We have previously acknowledged the potential of fearmongering, but why the need for this? The true reason may be the fear of losing geo-political power and influence in the region (Rajah et al., 2021, P19).  In the section for the west critiques the one belt one road initiative’s impact on the environment and the practice of debt-trap, we alluded to another covert underlying reason for why the west so fervently critiques the one belt one road initiative, particularly the fear of losing soft power and geo-political influence to China. The question that this statement alludes to is why the West would be so afraid of China’s growing power. One potential explanation is Orientalism, and particularly China’s resistance against democracy. China has succeeded despite not implementing the western ideals of civilization, particularly with democracy and capitalism, instead opting for her own path of socialism and authoritarianism (Peerenboom, 2007, P3). This success challenges the Western notion that democracy and capitalism are the ultimate markers of progress and civilization. The fear of losing geopolitical influence is further exacerbated by China's cultural and political export through OBOR (Anwar, 2019, P2). By spreading its cultural and political values, China aims to enhance its soft power and create a sphere of influence that rivals the West. This potential shift in global power dynamics is perceived as a direct threat to Western hegemony, leading to heightened scepticism and resistance. Economic competition is another significant factor driving Western scepticism. There is a fear that OBOR might give Chinese companies an unfair competitive advantage in global markets, particularly in infrastructure and construction sectors, potentially crowding out Western businesses. This fear is not unfounded, as Chinese government funded companies are used in the one belt one road initiative to manage the projects, gaining market access and dominance (Petkova, 2020, P2). Europe has realized that there are fundamental issues with its preferred socioeconomic structure. In addition to weakening internal European Union (EU) cohesion, the Belt and Road Initiative is making it more difficult for European businesses to reach markets in Asia and Europe and engage in trade and investment. European officials are becoming more and more aware that the benefits of the Belt and Road Initiative (BRI) extend beyond the borders of Europe and effect Asia's stability and power dynamics. (Geeraerts, 2019, P2). Trade imbalances exacerbated by OBOR further contribute to this concern. Increased Chinese exports and investments could lead to trade deficits for Western countries, undermining their economic stability. The mismatch between restricted European investment in China and China’s aggressive infrastructure investments in Europe highlights the strategic ramifications of Chinese economic dominance.   ",
    "image": "/images/b3w.jpg",
    "ref":"Fig. 4. Paresh Nath (2022), National View: Hypocrisy more than abundant at just-concluded climate summit. Retrieved June 21, 2025 from https://www.duluthnewstribune.com/opinion/columns/national-view-hypocrisy-more-than-abundant-at-just-concluded-climate-summit"
}